In [12]:
import pandas as pd

In [13]:
file = 'https://raw.githubusercontent.com/alyanien/DATASAINS/main/toyota.csv'
dataset = pd.read_csv(file, sep=',')
dataset.head()

   model  year  price transmission  mileage fuelType  tax   mpg  engineSize
0   GT86  2016  16000       Manual    24089   Petrol  265  36.2         2.0
1   GT86  2017  15995       Manual    18615   Petrol  145  36.2         2.0
2   GT86  2015  13998       Manual    27469   Petrol  265  36.2         2.0
3   GT86  2017  18998       Manual    14736   Petrol  150  36.2         2.0
4   GT86  2017  17498       Manual    36284   Petrol  145  36.2         2.0

In [15]:
#MEMPERLIHATKAN KOLOM MODEL, YEAR, DAN PRICE

In [14]:
data_1 = dataset[['model','year','price',]]
data_1.head()

   model  year  price
0   GT86  2016  16000
1   GT86  2017  15995
2   GT86  2015  13998
3   GT86  2017  18998
4   GT86  2017  17498

In [16]:
#MENAMPILKAN HANYA MODEL COROLLA DI TAHUN 2019

In [20]:
df_model = data_1[(data_1.year == 2019) & (data_1.model == " Corolla")]
df_model.head()

       model  year  price
73   Corolla  2019  22500
75   Corolla  2019  20250
77   Corolla  2019  21995
78   Corolla  2019  18995
79   Corolla  2019  22498

In [21]:
#MENCARI RATA RATA HARGA MOBIL COROLLA PADA TAHUN 2019

In [23]:
df_model['price'].mean()

21147.286343612333

In [24]:
df_model['price'].max()

27990

In [25]:
df_model['price'].min()

15291

In [66]:
#MENCARI TAU MOBIL COROLLA MANA DENGAN HARGA MAX

In [26]:
df_max = dataset[(dataset.year == 2019) & (dataset.model == " Corolla")& (dataset.price == 27990)]
df_max.head()

,model,year,price,transmission,mileage,fuelType,tax,mpg,engineSize
81,Corolla,2019,27990,Automatic,3650,Hybrid,135,72.4,2.0

In [71]:
#MENCARI TAU MOBIL COROLLA MANA DENGAN HARGA MIN

In [27]:
df_min = dataset[(dataset.year == 2019) & (dataset.model == " Corolla")& (dataset.price == 15291)]
df_min.head()

,model,year,price,transmission,mileage,fuelType,tax,mpg,engineSize
247,Corolla,2019,15291,Manual,7317,Petrol,145,39.2,1.2